const article = {
  "settings": {
    "coverImage": "https://avatars.mds.yandex.net/i?id=83f1e6eeb16286ca78297d7e6f3719f8cd4af13a-7083384-images-thumbs&n=13",
    "coverTitle": "Закрытия сайта Rivixal на не отложенное время",
    "coverAuthor": "Rivixal",
    "creationTime": "2025-03-28T22:51"
  },
  "blocks": [
    {
      "type": "header",
      "content": "Сайт Rivixal временно закрыт на реконструкцию."
    },
    {
      "type": "text",
      "content": "Всем привет! Как вы видите из этого сообщения, я действительно закрываю сайт на реконструкцию, переходя на модульность."
    },
    {
      "type": "text",
      "content": "<b><i><font style=\"font-size: 32px;\">Что такое модульность в моем пониманий?</font></i></b>"
    },
    {
      "type": "text",
      "content": "<p>В моем понимании модульность — это гибкость и удобство управления контентом на сайте. Я стремлюсь к тому, чтобы структура сайта позволяла легко публиковать как мои собственные проекты, так и сторонние приложения, при этом сохраняя порядок и удобную навигацию. Главная страница будет служить общей витриной, где все проекты будут отображаться вместе, но с возможностью сортировки по категориям. При этом мои разработки под моим именем Rivixal будут выделены в отдельный раздел, чтобы они не терялись среди остального контента. Такой подход делает сайт более универсальным, удобным для пользователей и простым в администрировании.</p>"
    },
    {
      "type": "text",
      "content": "Страница \"Инфо\", скорее всего будет переделана или удалена. Потому-что она содержит неправильную расстановку, и список изменений для обычных пользователей не особо будет интересен. Будет инфа о моих друзьях и обо мне"
    },
    {
      "type": "text",
      "content": "<font style=\"font-size: 32px;\"><b style=\"\"><i style=\"\">А что случится с блогами?</i></b></font>"
    },
    {
      "type": "text",
      "content": "<p data-start=\"0\" data-end=\"420\" class=\"\">Блог значительно улучшился! Если вы видите название <strong data-start=\"52\" data-end=\"69\">Rivixal Story</strong>, это означает, что блогинг вышел на новый уровень. Теперь посты будут адаптивными, с возможностью смены цветовой схемы, форматирования текста, добавления изображений (как с интернета, так и загруженных локально — но об этом позже), вставки видео и кода, если я захочу поделиться чем-то интересным. Именно этого функционала не хватало на моем сайте.</p><p data-start=\"0\" data-end=\"420\" class=\"\"><br></p>\n<p data-start=\"422\" data-end=\"669\" class=\"\">Кроме того, <strong data-start=\"434\" data-end=\"451\">Rivixal Story</strong> станет модульным. Вскоре вы сможете писать собственные посты и отправлять их мне на почту, где я буду их просматривать и решать, стоит ли их публиковать. Это сделает блог более интерактивным и открытым для сообщества.<br></p>"
    },
    {
      "type": "text",
      "content": "<p><b><font style=\"font-size: 32px;\"><i>Почему ты не настроишь автоматизацию на сервере? Или, может быть, у тебя уже есть собственный сервер?</i></font></b></p>"
    },
    {
      "type": "text",
      "content": "<p>Дело в том, что мой сайт работает на <strong>GitHub Pages</strong>, который является его основой. Это удобное и бесплатное решение, где не нужно беспокоиться о продлении хостинга, настройке SSL-сертификатов — все уже готово и работает без лишних забот.</p><p><br></p>\n<p>Что касается собственного сервера для хранения постов, то скорее <strong>нет, чем да</strong>. Финансовые возможности пока не позволяют приобрести хостинг и домен, а тем более оплачивать их продление. Было бы идеально найти вариант с бесплатным доменом и хостингом, который можно приобрести <strong>раз и навсегда</strong> — тогда собственный сервер имел бы смысл. Но пока что, как минимум в ближайшие два года, такое решение для меня недоступно.</p>"
    },
    {
      "type": "text",
      "content": "<b><font style=\"font-size: 31px;\"><i>Бездельничал все эти 5 месяцев? Или чем-то занимался?)</i></font></b>"
    },
    {
      "type": "text",
      "content": "Нет, не бездельничал. Все это время я продумывал концепцию модульности сайта как снаружи, так и изнутри. Хочу сделать его максимально удобным, чтобы добавлять приложения и статьи можно было без редактирования кода. Такой подход сделает управление контентом проще и интереснее.<br>"
    },
    {
      "type": "text",
      "content": "<p>Кроме того, я готовлюсь к переезду в Томск, чтобы сдать вступительные экзамены (если они не будут проходить онлайн), а до них уже осталось совсем немного времени. Мне не только важно поступить в этот вуз, но и хочется исследовать сам город — я обожаю новые места, виды и открытия. Возможно, в будущем я свяжу свою жизнь именно с этим городом.</p>"
    },
    {
      "type": "text",
      "content": "<font style=\"font-size: 32px;\"><b><i>Не боишься ли запретов на наличия популярных сервисов?</i></b></font>"
    },
    {
      "type": "text",
      "content": "Честно говоря, да, это меня беспокоит. Я боюсь потерять доступ к сервисам, которыми пользуюсь уже долгое время. Это создаст серьезные трудности не только в разработке ПО, но и лишит меня множества удобных инструментов и возможностей."
    },
    {
      "type": "text",
      "content": "<b><font style=\"font-size: 32px;\"><i>Когда выйдет данное обновление на сайте?</i></font></b>"
    },
    {
      "type": "text",
      "content": "Обновление может быть выйти в апреле 10-го числа, может и больше. Тут смотря как обстоят данные дела."
    },
    {
      "type": "image",
      "src": "https://avatars.mds.yandex.net/i?id=82174c7b0da5905e7d9aad4d1d894332c3546658-5256019-images-thumbs&n=13",
      "caption": "<i>Хоба, смотри что я могу :PPP</i>"
    },
    {
      "type": "video",
      "videoUrl": "https://www.youtube.com/embed/8PLGswXjJA0"
    }
  ]
};